{"2018-06-17": ["@Keith_Wasserman @Jason @Beyonce @warriors Thanks, good advice", "@FredericLambert @SwiftOnSecurity They have about three weeks before their short position explodes", "@c7five Good points. Already mostly working in the developer software I’m driving.", "@iamJeffTorres @thehartej @yaronbrook @VitalikButerin @RickandMorty Can’t wait for the new @RickandMorty season to start!", "@goombar3 We’ve always provided healthcare, hourly wages above union &amp; Tesla stock. Also, free drinks &amp; snacks. Try to make it fun too. Top ten hourly workers cumulatively received Tesla stock now worth $1M to $2M. Nobody wants UAW, so UAW keeps trashing Tesla &amp; me via 3rd parties.", "@taimurstriker Glad you teach physics. That and critical thinking (ie how not to be tricked) are foundational for all kids to learn.", "@iamJeffTorres @thehartej @yaronbrook @VitalikButerin Yeah, I think we pretty much agree. Btw, great show.", "@iamJeffTorres @thehartej @yaronbrook @VitalikButerin I think essential services, incl health care, should be taken care of by govt/taxpayers (socialist) &amp; other parts of economy should be served by companies competing to serve the people (capitalist). Aka, the view held by most of America.", "@mk_rodgers They started it &amp; attacked me personally", "Search UAW and “corruption”. Very long reading list. Great organization. https://t.co/9RVR31vzbc", "@iamJeffTorres @thehartej @yaronbrook @VitalikButerin “Profit” just means you earned more money than you spent &amp; certainly does spark innovation. Jesus. This is obv a good thing &amp; extremely hard. It has taken Tesla 15 years &amp; we’re almost there. Every other US car company besides Ford &amp; Tesla has gone bankrupt.", "@SwiftOnSecurity They don’t seem to think much or care about the future beyond a narrow horizon", "@haymarketbooks Engels wrote 2nd &amp; 3rd volumes based on Marx’s “notes”. Less reliable.", "@SwiftOnSecurity Wanted to help transition the world to sustainable, clean energy and extend life as we know it beyond Earth. Those problems require a lot of hardware.", "@doctorow @sahazel Wow, you know nothing &amp; are worthy of contempt. The world is under massive attack due to climate change &amp; you couldn’t care less.", "@JohnnaSabri @slack2thefuture @doctorow Read it. Like the green, translucent Martian opal?", "@JohnnaSabri @slack2thefuture @doctorow Iron pyrite", "@JimPuzzanghera Congratulations to LA Times and Patrick Soon-Shiong!", "@spookyozzy @slack2thefuture @doctorow You’re just a troll/bot, but I will reply anyway. I arrived in Montreal at 17 by myself with $2k. No support, no contacts, nothing. Father said I’d fail &amp; be back in 3 months.", "@TeslaCharts I don’t want to see anyone lose their money. Or I will at least provide fair warning before it happens, as I have done in the past.", "@slack2thefuture @doctorow You think all companies are bad and all unions good? That’s a very bigoted position.", "Well said https://t.co/lDPaIPLLzO", "@TeslaCharts Then you’ll be fine", "@JohnnaSabri @indiemusicfan9 @dimas_______ @Robotbeat @doctorow Exactly. Our NDA is actually shorter &amp; simpler than most.", "@indiemusicfan9 @dimas_______ @Robotbeat @doctorow ...which clearly doesn’t work. UAW and Wall Street shorts know every detail of what’s happening at Tesla. Storm clouds are gathering, so they’re getting desperate.", "@doctorow @dimas_______ @Robotbeat Then look a little closer, doctorow. Read the whole thread.", "@indiemusicfan9 @dimas_______ @Robotbeat @doctorow More propaganda. The NDA only prevents disclosure of Tesla proprietary IP or material non-public information (insider trading).", "@TeslaCharts How big is your short position? Just curious.", "@BobbieBees @dimas_______ @Robotbeat @doctorow Union flyers are handed out all the time in the factory. I know because people in the factory laugh at the ridiculous propaganda &amp; hand them to me. This one guy’s claim about being stopped once in a parking lot is false and irrelevant.", "@doctorow I endorse freedom to form a union too, as well as freedom not to do so if they feel Tesla is a good company. UAW has major conflicts of interest &amp; failed our car plant already when they abandoned us in 2010. Tesla can only hire 5% of applicants, so must be doing something right.", "@dimas_______ @Robotbeat @doctorow UAW doesn’t have 30% of signatures (about 6000 people) needed for a vote. They can’t even muster enough people for a free bbq. Instead, they’re getting paid trolls &amp; far left shills to trash Tesla &amp; me in press &amp; social media. Such creeps.", "@TheSithSeth @doctorow I’m not against all unions, but UAW has a track record of destroying productivity so a company can’t compete on world market. Our current factory went bankrupt under UAW before we took it over. Don’t want Tesla to die too.", "@Robotbeat @doctorow I am too, of sorts. Govt (ie other taxpayers) should take care of critical needs of people, incl defense, judiciary, health care, etc. Rest should be companies competing to provide best product or service to the people.", "@AntVenom @Shaynooooo @kausthav_ray @SpaceX Was originally called Puff the Magic Dragon, as people said I was high if though it could work, so I named it after their insult.", "@doctorow Iain certainly wasn’t pro-union in the Culture books. At all. And wouldn’t be in the case of Tesla. Banks was about freedom through &amp; through. Maybe for a single buyer (monopsony) vs single seller (monopoly), I would be too, but that’s a special case.", "@Shaynooooo @kausthav_ray @SpaceX https://t.co/sYo8iIodjG", "@leechy3 @kausthav_ray @SpaceX SX 300 &amp; soon SX 500. Kind of a modern version of Inconel superalloys. High strength at temperature, extreme oxidation resistance. Needed for ~800 atmosphere, hot, oxygen-rich turbopump on Raptor rocket engine.", "@kausthav_ray @SpaceX Structures, engines, avionics, guidance &amp; control software, new alloys, space lasers (ooh, maybe I shouldn’t have said that) …", "@mayemusk @kimbal Love you too 💕", "@johngoo 👽🧚‍♀️🚀🍃🍄🍕🍕🍕", "@RealMariaLOVE Fair point", "Auto-semiotic asphyxiation (sorry, couldn’t resist)", "@AntVenom And I don’t trust that Engels guy. He could have made up most of 2nd &amp; 3rd volumes. Nobody actually knows.", "@drgitlin Your math isn’t very good. Would require 61%. And what’s your issue anyway? Better suggestions are welcome."], "2019-12-29": ["@Erdayastronaut Direct drive using several Tesla Plaid motors in parallel for SN1. Simpler, lighter &amp; more fault tolerant. Rear flaps each need ~1.5 megawatts. It’s like moving the entire wing of an aircraft!", "@TeslaGong @BrianGilbert_ @Tesla @AusTeslaOwners Tesla merch def needs some love, but too many fish to fry rn", "@TeslaGong @BrianGilbert_ @Tesla @AusTeslaOwners Coming …", "@ajtourville @Erdayastronaut Tesla uses that to wirebond cells to module current collectors. Is there a commercially available machine that can weld ~4mm full hard 301 stainless barrels &amp; domes?", "@Kristennetten @SmileSimplify @Erdayastronaut We’re focusing on Boca right now for Starship &amp; Cape is focused on Falcon/Dragon", "@Erdayastronaut Spin start from COPVs so the ox &amp; fuel turbines spool up super fast in unison. A precise start with full flow staged combustion is very important.", "@SmileSimplify @Erdayastronaut Moving to an enclosed (fairly) clean room environment for SN2 in Jan, although, unlike aluminum, stainless steel welding is not super sensitive. Our main issue here in Boca is that it can get very windy, which affects weld arc &amp; steel melt pool.", "@Erdayastronaut No, will be autogenous from the start, tapping hot CH4 &amp; O2 from Raptor", "@teslaownersSV @TonyCrisostomo @Erdayastronaut Yeah", "@Erdayastronaut Best would probably be an autogenous laser weld, but we need more precise parts &amp; fixtures. Hopefully get that done in 2020.", "@Erdayastronaut Almost everything is different. These parts are stamped vs manually bump-formed &amp; TIP TIG welded vs flux core. Higher precision, stronger joints &amp; 20% mass reduction.", "@DJSnM We use that process for the Raptor nozzle jacket. The knuckles of this dome are stamped in Michigan with a 4000 ton car body press, which costs much less for same outcome.", "Almost three now. Boca team is crushing it! Starship has giant dome 🤣🤣 https://t.co/qTN2TU02pb", "@donnyraywoody @flcnhvy @kulpability @NASA Haha true", "@flcnhvy muffin or not-muffin", "@realRickyReeves @Erdayastronaut @NASA Crew Dragon is capable of propulsive landing, but would require extensive testing to prove safety. Better to focus on Starship.", "@kulpability @NASA New technology development schedules tend to exhibit a version of Zeno’s Paradox — at any given point, you’re halfway there", "@kulpability @NASA Crew Dragon should be physically ready &amp; at the Cape in Feb, but completing all safety reviews will probably take a few more months", "Simulation of first crewed flight of Falcon 9 / Dragon 2020 @NASA https://t.co/BSDPYTcVIG", "8 years later, the simulation is mostly real", "@vincent13031925 @Tesla @jsrdctz Amazing work by Tesla China team!! ❤️❤️", "@28delayslater 🤣🤣", "@BrianGilbert_ @Tesla @AusTeslaOwners Tesla app based payment will soon be rolled out WW. It’s tough making functionality work across so many regulatory domains.", "@BrianGilbert_ @Tesla @AusTeslaOwners Is purchasing through the Tesla app not working?", "@teslaownersSV @iam_preethi I def believe in the ethical treatment of animals &amp; taking action of climate, but these are mostly separate moral issues", "@EvaFoxU @TeslaHistorian @TeslaOwnersofMA @JohnnaCrider1 @vincent13031925 @boringcompany Nice", "@teslaownersSV @iam_preethi Renewable energy production (solar, wind, geothermal), improving home insulation &amp; electric transport will do the trick. Vegan/vegetarian helps a little, but isn’t critical. We should take the set of actions that maximize total public happiness!", "@ingmutw @iam_preethi @Tesla Ok", "@iam_preethi I support people choosing whatever diet makes them happy, but it’s true that everyone going vegan still wouldn’t stop climate change. Moving billions of tons of hydrocarbons from deep underground into the atmosphere &amp; oceans is fundamentally the issue.", "@C3LT_Games 😎", "Dam now rly want choc chip muffin", "@28delayslater @TeslaOwnersofMA @JohnnaCrider1 @vincent13031925 @boringcompany Slight tweak to the glass needed &amp; then it should be good to go", "😮 https://t.co/JejV2rBFrf", "@TeslaOwnersofMA @JohnnaCrider1 @vincent13031925 @boringcompany What is the platonic ideal of the perfect candy? Really feels like candy R&amp;D hasn’t improved in ages. Damn candy oligarchs!! [shakes fist at sky]", "@JohnnaCrider1 @vincent13031925 @boringcompany Yeah, Boring Bricks 🧱 are def coming, but whole team is focused on getting Vegas Convention Center tunnel operational so people can try it out, suggest improvements, etc. I ♥️ crowdsourcing ideas with people who really care about making great products!", "@vincent13031925 @boringcompany Certainly worth trying! The objective reality for large cities worldwide is that efforts to solve traffic have not worked well. If we don’t try *something* new, we will be in traffic hell forever.", "@JonAttenborough @cFidd Absolutely. Multi-level tunnels can go under buildings, mountains, rivers or anything else &amp; directly connect destinations, like aircraft do in the sky. We just need more of them.", "@ollie_turrell @cFidd Pretty much", "@Snipergen @Tesla Sure. Trax will get much better &amp; more fun. This is an alpha version.", "@cFidd No, I said we should build more tunnels. Put trains in them or cars or whatever, but every large city on Earth is plagued by traffic &amp; it’s getting worse. Multi-level tunnels might solve this, so worth trying. If you have a better suggestion, please tell us what it is.", "@RationalEtienne @EvaFoxU @amargosavalley That might have something to do with it. “Stalin: Court of the Red Tsar” was one of the few books so dark I had to stop reading. If only they’d listened to Lenin’s last wish, much tragedy may have been averted.", "@EvaFoxU @amargosavalley For sure, but I understand the pulse of Twitter pretty well. A sudden avalanche of very similar vitriolic comments from anon accounts usually means someone activated a troll/bot net.", "@amargosavalley Thousands of anon/troll/bot accounts suddenly on the attack. Interesting.", "@ToscaMusk @kimbal ❤️ you too sis"], "2018-05-26": ["@PassionPlanet1 @oneunderscore__ @ParkerMolloy @2sunsky @ashleyfeinberg You’re right. These guys can buzzkill themselves (pun intended). Signing off …", "@joshuatopolsky @oneunderscore__ @ParkerMolloy @2sunsky @ashleyfeinberg Who do you think *owns* the press? Hello.", "@oneunderscore__ @ParkerMolloy @2sunsky @ashleyfeinberg You’re missing the point &amp; living in a bubble of self-righteous sanctimony. The public doesn’t trust you. This was true *before* the last election &amp; only got worse. Don’t believe me? Run your own poll …", "@oneunderscore__ @ParkerMolloy @2sunsky @ashleyfeinberg You’re welcome to come by SpaceX, but please stop assuming I’m against all journalists. This is not true. Something needs to be done to improve public trust in media.", "@oneunderscore__ @ParkerMolloy @2sunsky @ashleyfeinberg You really think I haven’t spent time in a newsroom? I’ve spent time in too many. Bleak.", "@ParkerMolloy @2sunsky @oneunderscore__ @ashleyfeinberg Sadly, it had better critical analysis than most non-cult media", "@RBryant2012 Yup, deleted", "@MacTechGenius @DMC_Ryan @ConsumerReports ? It should", "@davinalexmma @DMC_Ryan No, but dual motors mean increased regen braking &amp; will ride tire traction limit. You won’t notice sport brakes unless you’re on a racetrack &amp; have the sticky 20” tires.", "@DMC_Ryan Also, firmware fix for upgraded brake performance on standard Model 3 started rolling out yesterday. Should improve braking distance by ~20 ft for repeated heavy braking events. Thanks @ConsumerReports for excellent critical feedback!", "@DMC_Ryan Yes, Model 3 Performance will have red calipers &amp; sport level brakes", "@mike_marchioni Keyword “future” 🤣", "@dfsullivan ♥️🖤🚀🎶👻🐇🧚‍♀️💫", "😃\nhttps://t.co/9kUYHCCaRN", "@SmileSimplify @nitantbhartia @ninoles @medickinson @thephysicsgirl Will do another rev before final design", "@AJemaineClement I was", "@ali01 @KTmBoyle @washingtonpost @JohnCarreyrou @decentralion That’s what I had in mind", "@AntVenom @BoredElonMusk Sometimes even I think we’re the same person!", "@omcintyre @CrampedEyes @SpaceX @Tesla @upulie Nanotech *is* bs imo. When you take something that has nothing to do w gender &amp; make it about that, you devalue genuine gender issues.", "@CalebHarmon5 About to ship. @BoringCompany holding flamethrower pickup parties in a week or so, then deliveries begin. Check https://t.co/WTl3TOTOkt for details.", "@DriverX_ It’s not", "@Br1__Rodriguez That’s a great song!", "Sometimes … when I have hurt feelings, I play this song …\nhttps://t.co/QK6cECmxsS", "@sjanus_pl @iloveshw No, that’s the other guy @BoredElonMusk", "@firefire100 @rjcc So true 😢", "@rjcc Because Twitter is fun", "@MDMGeek @theknifemedia USAToday FTW!", "@iloveshw Dank is wack unless you’re on weed", "@petehague @ceciliakang Exactly. And NYT could have anyone post an Op Ed. Why, of all people, are they choosing to publish this “non-journalist” who is also pro gasoline cars? Is this just published as counterpoint? I assume NYT does believe in climate change?", "But femtotech is the future … https://t.co/NODkOer8oS", "Nanotech is so 2008. Picotech is 1000 times better.", "Yeah, that’s exactly right. But after suggesting public critique, I was stunned to see the level of contempt many in media have for their readers. This is way worse than I thought. https://t.co/NMAks4jrZ1", "@dimas_______ @AlexCJoachim @RitNagar @jbinero @hubertlepicki @Jason @nytimes @BretStephensNYT The arguments journos are using against the public are word for word the same arguments despots use against democracy", "Well said. NYT journo is outraged that “dumb” public wd dare critique him while attacking me for being sensitive to criticism. Uhh... https://t.co/vZbyUY1rf4", "@TKhopshanosov @SaxMike71 @ebol94 @teslainventory @Tesla A Tesla has a usable reserve of 5 to 15 miles range even after the battery reads “empty”. This will not hurt the pack.", "@nitantbhartia @ninoles @medickinson @thephysicsgirl Pretty good. TinTin A &amp; B are both closing the link to ground w phased array at high bandwidth, low latency (25 ms). Good enough to play fast response video games.", "@ssBlueStockings @ninoles @medickinson @thephysicsgirl It’s cool for kids &amp; if used in a fun way, but if you called yourself a “rocket scientist” in aerospace, they would think you’re 🙃", "@JuBeBallin I just sent a note to Tesla service to take care of your car right away &amp; our HVAC engineering lead to fix root cause", "@Pocketsdog @omcintyre @CrampedEyes @SpaceX @Tesla Does the psych ward know you smuggled in a mobile phone?", "@aquastellaris @Pocketsdog @omcintyre @CrampedEyes @SpaceX @Tesla The pain will end", "Wow, amazing Tesla hypermile drive happening https://t.co/jJWufZ98C9", "@tedhu @omcintyre @CrampedEyes @SpaceX @Tesla Gwynne has been prez of SpaceX for 10 years &amp; well-deserved https://t.co/XL581njDHP", "@Pocketsdog @omcintyre @CrampedEyes @SpaceX @Tesla Stop trying to charm me. It won’t work. Ok, maybe a little 😊 Are you a real person or a bot?", "@ninoles @medickinson @thephysicsgirl Using “rocket science” non-ironically in a bio is never a good sign, especially if you work on 🚀🔬", "@omcintyre @CrampedEyes @SpaceX @Tesla What are you talking about? You’re being incredibly rude &amp; nonsensical.", "@ishanspatil @kNewsSpace Wow, haven’t watched that video in ages. When we made that, no one in the space industry thought it would actually happen.", "@Jessicalessin Generally higher quality reporting, especially if not under pressure to publish fast. Consumer Reports is great (and often critical of Tesla). Heard good things about The Information too.", "Can’t believe someone leaked this schematic of the Tesla production system!! https://t.co/ylAX3uKTI1"], "2019-02-21": ["@nextspaceflight It’s designed to be way better. We’ll see what reality has to say about that.", "@nextspaceflight Yes, lot of risk", "@TGMetsFan98 @nextspaceflight Guys, I have feelings … 😜", "@flcnhvy @rogiermaas @SpaceX Focusing on Starship instead", "@rogiermaas @SpaceX Deorbits &amp; burns up over the Pacific", "@Erdayastronaut @CanzyD Upper stage is flight, except mass sim in place of Merlin. It will get fragged for sure by aero loads &amp; Dragon abort thrusters.", "@SpaceXUpdates @CanzyD Including Heavy, which is 3 cores, around 20 or so", "@nextspaceflight Depends on when Crew Dragon comes back. That’s scheduled for launch next Saturday, but lot of new hardware, so time error bars are big.", "@CanzyD High probability of this particular rocket getting destroyed by Dragon supersonic abort test. Otherwise, at least 20 or 30 missions for Falcon 9. Starship will take over before the F9 fleet reaches end of life.", "@SpaceXUpdates Crew Dragon high altitude abort test", "@sivarajkumar237 Yes 😀", "Highest reentry heating to date. Burning metal sparks from base heat shield visible in landing video. Fourth relight scheduled for April. https://t.co/uq6TdMhgFN", "@abbygarrettX @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Always liked Kestrel. It was the Robin Hood of engines.", "@DJSnM @DanAloni @Kell31213876 @Vadim15258417 @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Advanced, reusable rockets are all we need to become a multiplanet civilization. Once we have a city on Mars, interplanetary travel will create a forcing function for vast improvements in spaceflight.", "@gavbrowne @bluemoondance74 @DanAloni @Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey SN2 has changes that should help", "@balcsi32 @DanAloni @Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey To the first part. I doubt we’d create a Dyson ring or sphere.", "@balcsi32 @DanAloni @Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Yes", "@bluemoondance74 @DanAloni @Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Merlins. The max chamber pressure run damaged Raptor SN 1 (as expected). A lot of the parts are fine for reuse, but next tests will be with SN 2, which is almost done.", "@DanAloni @Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Anti-matter production would require vast amounts of energy. No need though. We have a super reliable, massive, free fusion reactor called the sun.", "@Kell31213876 @Vadim15258417 @DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Exactly. Super money move is anti-matter drive, especially if you solve capturing antiprotons in deep space.", "@DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey You can see the streaks on the vacuum Merlin nozzle in flight videos", "@DJSnM @Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Pinter injector tends to have hot &amp; cold streaks. Hot streaks burn a rut at the throat that accelerates erosion.", "@benoitdenayer @navincho @katlinegrey Essentially, yes. Great engineering talent, but should focus on reusable rockets for purpose of a permanent human base on the moon and self-sustaining city on Mars.", "@RichPitre_CO @katlinegrey We are constrained by the accredited investor rule, but will think about how this could be done", "@Erdayastronaut @sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey Yeah, that was a bit embarrassing ☺️High engine chamber pressure and ablative don’t get along. Ok for low pressure, expendable upper stage.", "@sasor098 @AdamHugo @WayCharMar @fan_of_racing @bkent136 @macodiseas @katlinegrey That’s true 😀 Merlin 1A was terrible. 1C was ok, 1D good, but block 5 Merlin (should probably be called 1E) is something special. Took about 15 years to get there.", "@Erdayastronaut @MarekCyzio @katlinegrey Actually, they received (and still receive) almost a billion dollars a year for “launch capability”. Even if they do zero launches, US govt still gives them that.", "@Geopilot @katlinegrey Don’t know", "@katlinegrey SpaceX commercial 🚀 launch market share went from 0% in 2010 to 65% in 2018. Despite massive subsidies to Boeing/Lockeed, they have never won a fair competition against SpaceX for several years. https://t.co/sqAYCCcJtd", "@martinengwicht @macodiseas @katlinegrey Exactly. That’s the critical point for Starship/BFR: more payload than the biggest rocket ever made, but for less money per launch than the smallest (orbital) rocket. Without something that lowers orbital flight cost by 100X, humanity will never be a multiplanet species.", "@fan_of_racing @bkent136 @macodiseas @katlinegrey SpaceX Merlin architecture is simpler than staged combustion (eg SSME or RD), but it has world record for thrust/weight &amp; thrust/cost engine. Raptor has better Isp, but I’m worried it may fall short on those two critical metrics.", "@wonderofscience So true 🤡 John Clarke 👌", "@macodiseas @katlinegrey Not true. Limiting factor in any staged combustion rocket engine, liquid/gas or gas/gas, is pressure &amp; temperature in oxygen preburner", "@Tom_Heats @coindesk Whoever owns the early BTC deserves a Nobel prize in delayed gratification", "@katlinegrey I have been chief engineer/designer at SpaceX from day 1. Had I been better, our first 3 launches might have succeeded, but I learned from those mistakes. https://t.co/3r6ZqEc30A"], "2020-04-15": ["@teslaownersSV @flcnhvy @dschless @Bob_Wachter A mask or nose “ventilator” with moderately increased oxygen % will help. This is common in hospitals. Intubation, where a tube is jammed down your throat under sedation &amp; you’re fed high pressure, pure oxygen for several days to weeks is questionable.", "@flcnhvy @dschless @Bob_Wachter Sounds about right https://t.co/pEPVJi56Vg", "@dschless @Bob_Wachter Roughly what is the survival rate of intubated patients? I’m hearing 10% to 20%. Is this overly pessimistic?", "@TJShannon87 @Bob_Wachter I know of two nurses who had their job offers revoked, one in NYC and one in Arlington", "@annerajb @samoanpunch @cromas @Bob_Wachter We’re working super hard on getting traffic lights &amp; stops released. Reverse summon (auto park) will be part of the core Autopilot software upgrade for FSD later this year.", "@Bob_Wachter They were, but are they currently?", "@samoanpunch @cromas @Bob_Wachter Interesting", "@Bob_Wachter We are hearing almost all hospital ICUs have excess capacity. In some cases, 60% empty.", "@RationalEtienne @PPathole @fat__tire @Kristennetten @Robotbeat @ghotiing @CruizVinicius @josh119872 @SweetINXS @voteLabonte @Erdayastronaut @Tesla Does seem that early use is wise. Solving late stage C19 probably requires two or three mechanisms of action.", "@Erdayastronaut @BnOrdhaug @sivanithu @tobyliiiiiiiiii @cabral_psyd @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab @Peter_J_Beck Sure", "@Erdayastronaut @sivanithu @tobyliiiiiiiiii @cabral_psyd @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab @Peter_J_Beck Production is by *far* the hard part. That’s why I’m not super worried about early Starship failures. Initial serial numbers are suboptimal, so would be lawn ornaments if they survived. That said, as lawn ornaments go, they’re pretty sweet …", "@nextspaceflight @Erdayastronaut @sivanithu @tobyliiiiiiiiii @cabral_psyd @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab @Peter_J_Beck SN4 won’t get flaps, so can only do flights with engine on. Just did a reset this week on flap, actuator &amp; static aero design. Either SN5 or SN6 will get flaps.", "@KeithMansfield @Erdayastronaut @sivanithu @tobyliiiiiiiiii @cabral_psyd @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab @Peter_J_Beck That’s for sure! 😅", "@Erdayastronaut @sivanithu @tobyliiiiiiiiii @cabral_psyd @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab @Peter_J_Beck I have great respect for anyone who gets a rocket to orbit! It’s very hard. I’m spending crazy hours on Starship design/production. It is truly an honor to work with such great engineers. SN4 is almost done 😀", "@PPathole @fat__tire @Kristennetten @Robotbeat @ghotiing @CruizVinicius @josh119872 @SweetINXS @voteLabonte @Erdayastronaut @Tesla My (again) personal favorite is https://t.co/rM1MqsVsr1", "@sivanithu @tobyliiiiiiiiii @cabral_psyd @Erdayastronaut @imatsb @thesheetztweetz @SciGuySpace @Some1gee @RocketLab Some of the small launcher activity is cool, especially @rocketlab. Downsides are helicopter retrieval doesn’t scale to bigger rockets &amp; is highly weather-dependent. Also, propulsive landing is needed for moon/Mars. That said, it’s probably right move for small LEO vehicle.", "@fat__tire @Kristennetten @Robotbeat @ghotiing @CruizVinicius @josh119872 @SweetINXS @voteLabonte @Erdayastronaut @Tesla Vast majority of “ventilators” are not intratracheal, but, yes, jamming a pipe down a patient’s throat &amp; driving in high pressure, pure oxygen is definitely not how we evolved! My personal choice would be mask with moderate pressure at ~50% O2.\nhttps://t.co/pEPVJi56Vg", "@tobyliiiiiiiiii @cabral_psyd @sivanithu @Erdayastronaut @imatsb @thesheetztweetz @SciGuySpace @Some1gee SN26", "@cabral_psyd @sivanithu @Erdayastronaut @imatsb @thesheetztweetz @SciGuySpace @Some1gee Merlin is arguably version 6 or 7 by now. It’s a real workhorse, but looks so simple next to Raptor!", "@PPathole @Robotbeat @ghotiing @CruizVinicius @josh119872 @SweetINXS @voteLabonte @Erdayastronaut @Tesla The way things are looking right now, the world will soon be flooded with excess ventilators. Even NY is giving them away!", "@Erdayastronaut @imatsb @thesheetztweetz @SciGuySpace @Some1gee Fundamentally, Atlas is still dependent on Russia to launch", "@Erdayastronaut @imatsb @thesheetztweetz @SciGuySpace @Some1gee Yeah, Atlas main engine is Russian. Great engine, but not US. Also, their fairing is Swiss. I think interstage &amp; payload separation system also not US.", "@Robotbeat @ghotiing @CruizVinicius @josh119872 @SweetINXS @voteLabonte @Erdayastronaut @Tesla Tesla actually sent out ResMed, Philips &amp; Medtronic units. Latter is fully intratracheal. My personal opinion is that some ICUs are jumping the gun on intubation &amp; setting PEEP &amp; O2 too high. High pressure, pure oxygen increases risk of lung damage. https://t.co/2IUnS5DPOg", "@Erdayastronaut @thesheetztweetz @SciGuySpace @Some1gee Sorry, meant to say only US rocket. Atlas V is close, but not yet 100%.", "@davidmholtom @Nu23ro @SciGuySpace Tesla *was* saved by an investment in May 2009 from Daimler, not govt. Without that Daimler support, Tesla would have died. Super appreciated!", "@davidmholtom @Nu23ro @SciGuySpace Exactly. In mid 2009, Tesla received non-binding approval for loan program actually signed into law by Bush in late 2008. First actual disbursement was Q2 2010, long after BK danger passed. Loan was repaid early with interest. Taxpayers made money on it!!", "@thesheetztweetz @SciGuySpace @Some1gee Last I checked, over a million dollars less. Moreover, F9 is launching far more often &amp; is only rocket fully NASA-approved for launching astronauts, so that gap is increasing.", "@SciGuySpace @Some1gee Also, it costs less $ to insure a Falcon 9 mission. That’s the acid test.", "@SciGuySpace True. Only reason other medium &amp; heavy lift rocket companies are winning any missions at all is due to govt intervention. Otherwise, they’d be as defunct as expendable airplane companies. ULA is powered by lobbying."]}